src/config/InformationRegisters/ПровереннаяНагрузкаДисков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПровереннаяНагрузкаДисков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрошедшаяНагрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерКонтейнера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТестПройден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/ЖурналИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЖурналИзменений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.БюджетДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
						<v8:Type>cfg:DocumentRef.БюджетРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/ПровереннаяНагрузкаДисков/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	#Если Клиент Тогда
		Если НЕ Замещение и ЭтотОбъект.Количество() > 0 Тогда //Это новая запись
			
			Попытка	
				
				Для каждого стр из ЭтотОбъект Цикл	
					Набор = РегистрыСведений.ЖурналИзменений.СоздатьМенеджерЗаписи();
					Набор.Период = ТекущаяДата()+1;
					Набор.Активность = Истина;
					Набор.Пользователь= глТекущийПользователь;
					Набор.Объект = ЭтотОбъект.Отбор.Номенклатура.Значение;
					Набор.НомерЗаписи = 1;
					Набор.Компьютер = ИмяКомпьютера();
					
					Набор.Событие = "Добавление новой записи";
					Набор.Комментарий = "Стало: Дата: "+стр.Дата+" ; Тест пройден: "+стр.ТестПройден+" ; Прошедшая нагрузка: "+стр.ПрошедшаяНагрузка;
					Набор.ОбъектМетаданных = "Добавление новой записи";
					Набор.Записать();
				КонецЦикла;
			Исключение
				
			КонецПопытки;
			
		ИначеЕсли Замещение и ЭтотОбъект.Количество() = 0 Тогда //Удаление
			
			ЭтотОбъект.Прочитать();
			
			Попытка	
				
				Для каждого стр из ЭтотОбъект Цикл	
					Набор = РегистрыСведений.ЖурналИзменений.СоздатьМенеджерЗаписи();
					Набор.Период = ТекущаяДата();
					Набор.Активность = Истина;
					Набор.Пользователь= глТекущийПользователь;
					Набор.Объект = ЭтотОбъект.Отбор.Номенклатура.Значение;
					Набор.НомерЗаписи = 1;
					Набор.Компьютер = ИмяКомпьютера();
					
					Набор.Событие = "Удаление записи";
					Набор.Комментарий = "Было:   Дата: "+стр.Дата+" ; Тест пройден: "+стр.ТестПройден+" ; Прошедшая нагрузка: "+стр.ПрошедшаяНагрузка;
					Набор.ОбъектМетаданных = "Удаление записи";
					Набор.Записать();
				КонецЦикла;
				
			Исключение
				
			КонецПопытки;
			
			ЭтотОбъект.Очистить();
			
		Иначе 
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры
